app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Product 1"], ["description", "descriprion 1"], ["user_id", 1], ["created_at", "2021-11-29 18:55:59.542512"], ["updated_at", "2021-11-29 18:55:59.542512"]]
UPDATE "products" SET "correct" = $1, "total" = $2, "status" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["correct", 2], ["total", 2], ["status", 1], ["updated_at", "2021-11-29 20:25:20.926768"], ["id", 1]]
INSERT INTO "variants" ("name", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Product 1"], ["product_id", 3], ["created_at", "2021-11-29 19:05:54.948791"], ["updated_at", "2021-11-29 19:05:54.948791"]]
---
  def create
    validate = ValidateSchemas.create_product(request.request_parameters)
    return render json: badRequest(validate) if !validate.empty?
    product = @user.products.create(product_params)
    if product.valid?
      UploadVariants.delay.save_variants(product,params[:variants])

SELECT "products".* FROM "products" WHERE "products"."user_id" = $1 AND "products"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_product
      @product = @user.products.find_by(id: params[:id])