app/controllers/api/v1/sessions_controller.rb

  def login
    user = User.find_by(username: params[:username])
    if user && user.authenticate(params[:password])
      token = encode_token({user_id: user.id})
      user.update_columns(last_sign_in_at: Time.now,sign_in_count: (user.sign_in_count.to_i + 1))
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Admin"], ["LIMIT", 1]]
UPDATE "users" SET "last_sign_in_at" = $1, "sign_in_count" = $2 WHERE "users"."id" = $3  [["last_sign_in_at", "2021-11-29 18:40:35.527207"], ["sign_in_count", 1], ["id", 1]]