app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def logged_in_user
    user_id = decoded_token['user_id'] if decoded_token.present?
    @user = User.find_by(id: user_id)