app/jobs/upload_variants.rb

INSERT INTO "variants" ("name", "price", "product_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Name 3"], ["price", "1500.0"], ["product_id", 1], ["created_at", "2021-11-29 20:25:20.921301"], ["updated_at", "2021-11-29 20:25:20.921301"]]
UPDATE "products" SET "correct" = $1, "total" = $2, "status" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["correct", 2], ["total", 2], ["status", 1], ["updated_at", "2021-11-29 20:25:20.926768"], ["id", 1]]
---
  def create
    self.product.total = self.variants.count
    variants.each do |variant|
      sv = self.product.variants.create({name: variant[:name], price: variant[:price]})
      if sv.valid?
        self.product.correct = self.product.correct + 1
      else
        self.product.incorrect = self.product.incorrect + 1
      end
    end
    self.product.status = 1
    self.product.save